doc/pq-native/t06-remove-liquid-fixture-reference-mutant.patch
diff --git a/crypto/test/test-smartcont.cpp b/crypto/test/test-smartcont.cpp
index 71441538f..05a8d10fa 100644
--- a/crypto/test/test-smartcont.cpp
+++ b/crypto/test/test-smartcont.cpp
@@ -360,7 +360,7 @@ std::string run_validator_fift_script_regression() {
   // Historical Ed25519 byte parity only; the current liquid controller
   // requires a PQ-shaped pool order and this is not an operator command.
   auto controller_lookup =
-      fift::create_mem_source_lookup(load_source("test/fift/fixtures/liquid-controller-legacy-elect-signed.fif"))
+      fift::create_mem_source_lookup(load_source("test/fift/fixtures/liquid-controller-legacy-elect-missing.fif"))
           .move_as_ok();
   controller_lookup.set_os_time(std::make_unique<FixedOsTime>(kFixedFiftNow));
   write_masterchain_address_file(controller_lookup, "wallet.addr", kScriptWalletAddrHex);
