doc/pq-native/n5-accept-proof-hash-bypass-mutant.patch
--- a/test/pq-native/c04-real-state-proof-test.cpp
+++ b/test/pq-native/c04-real-state-proof-test.cpp
@@ -414,7 +414,7 @@ class PendingFinalityManagerActorProbe final : public ValidatorManagerImpl {
           if (result.is_error()) {
             return promise.set_error(result.move_as_error_prefix("N5 cold BlockProof: "));
           }
-          if (block::compute_file_hash(result.ok()->data().as_slice()).to_hex() != expected_proof_hash) {
+          if (false && block::compute_file_hash(result.ok()->data().as_slice()).to_hex() != expected_proof_hash) {
             return promise.set_error(td::Status::Error("N5 cold BlockProof bytes differ from writer"));
           }
           auto root = result.ok()->get_root_cell();
