doc/pq-native/n5-consensus-journal-write-mutant.patch
diff --git a/test/pq-native/n5-manager-db-fixture-test.cpp b/test/pq-native/n5-manager-db-fixture-test.cpp
--- a/test/pq-native/n5-manager-db-fixture-test.cpp
+++ b/test/pq-native/n5-manager-db-fixture-test.cpp
@@ -194,7 +194,6 @@ int main(int argc, char **argv) {
   if (child) {
     if (std::string_view(argv[1]) == "--write") {
-      if (!run_actor(id, state, std::move(boc), argv[3], true, true) ||
-          !write_consensus_marker(consensus_path(argv[3], session_id))) {
+      if (!run_actor(id, state, std::move(boc), argv[3], true, true)) {
         return 1;
       }
       std::cout << "N5_DUAL_DB_WRITER_EXIT_OK root=" << argv[3] << '\n';
