doc/pq-native/n5-finalcert-save-mutant.patch
diff --git a/test/pq-native/n5-manager-db-fixture-test.cpp b/test/pq-native/n5-manager-db-fixture-test.cpp
--- a/test/pq-native/n5-manager-db-fixture-test.cpp
+++ b/test/pq-native/n5-manager-db-fixture-test.cpp
@@ -119,7 +119,7 @@ class N5FinalCertPublisher final : public td::actor::Actor {
                                td::Promise<td::Unit> promise) {
     // This invokes simplex/db.cpp::process(SaveCertificate), including its
     // production db_key_vote(hash(inner TL)) / db_cert(inner TL) write.
-    auto result = co_await bus.publish<sx::SaveCertificate>(std::move(cert)).wrap();
+    auto result = td::Result<td::Unit>(td::Unit{});
     if (result.is_error()) {
       promise.set_error(result.move_as_error());
       co_return td::Unit{};
